#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# 12. Путем вставок и удаления символов исправить ошибки:
# в слове прроцесор;
# во фразе теекстовыйфайл;
# во фразе програма и аллгоритм;
# во фразе процесор и паммять.


if __name__ == '__main__':
    s1 = 'прроцесор'
    s2 = 'теекстовыйфайл'
    s3 = 'програма и аллгоритм'
    s4 = 'процесор и паммять'

    for a in (('рр', 'р'), ('с', 'сс')):
        s1 = s1.replace(*a)
    for b in (('ее', 'е'), ('йф', 'й ф')):
        s2 = s2.replace(*b)
    for c in (('м', 'мм', 1), ('лл', 'л')):
        s3 = s3.replace(*c)
    for d in (('с', 'сс'), ('мм', 'м')):
        s4 = s4.replace(*d)

    print(f'прроцесор = {s1}')
    print(f'теекстовыйфайл = {s2}')
    print(f'програма и аллгоритм = {s3}')
    print(f'процесор и паммять = {s4}')